rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32M27x_GDU_AE.h
#define GDU_AE_OFFSDCFG_OSDPU2_MASK              (0x40U)
#define GDU_AE_OFFSDCFG_OSDPU2_SHIFT             (6U)
#define GDU_AE_OFFSDCFG_OSDPU2_WIDTH             (1U)
#define GDU_AE_OFFSDCFG_OSDPU2(x)                (((uint8_t)(((uint8_t)(x)) << GDU_AE_OFFSDCFG_OSDPU2_SHIFT)) & GDU_AE_OFFSDCFG_OSDPU2_MASK)
/*! @} */

/*! @name DSCFG - Desaturation Level */
/*! @{ */

#define GDU_AE_DSCFG_DSLLS_MASK                  (0x7U)
#define GDU_AE_DSCFG_DSLLS_SHIFT                 (0U)
#define GDU_AE_DSCFG_DSLLS_WIDTH                 (3U)
#define GDU_AE_DSCFG_DSLLS(x)                    (((uint16_t)(((uint16_t)(x)) << GDU_AE_DSCFG_DSLLS_SHIFT)) & GDU_AE_DSCFG_DSLLS_MASK)

#define GDU_AE_DSCFG_DSLHS_MASK                  (0x70U)
#define GDU_AE_DSCFG_DSLHS_SHIFT                 (4U)
#define GDU_AE_DSCFG_DSLHS_WIDTH                 (3U)
#define GDU_AE_DSCFG_DSLHS(x)                    (((uint16_t)(((uint16_t)(x)) << GDU_AE_DSCFG_DSLHS_SHIFT)) & GDU_AE_DSCFG_DSLHS_MASK)

#define GDU_AE_DSCFG_DSFLS_MASK                  (0x300U)
#define GDU_AE_DSCFG_DSFLS_SHIFT                 (8U)
#define GDU_AE_DSCFG_DSFLS_WIDTH                 (2U)
#define GDU_AE_DSCFG_DSFLS(x)                    (((uint16_t)(((uint16_t)(x)) << GDU_AE_DSCFG_DSFLS_SHIFT)) & GDU_AE_DSCFG_DSFLS_MASK)

#define GDU_AE_DSCFG_DSFHS_MASK                  (0x3000U)
#define GDU_AE_DSCFG_DSFHS_SHIFT                 (12U)
#define GDU_AE_DSCFG_DSFHS_WIDTH                 (2U)
#define GDU_AE_DSCFG_DSFHS(x)                    (((uint16_t)(((uint16_t)(x)) << GDU_AE_DSCFG_DSFHS_SHIFT)) & GDU_AE_DSCFG_DSFHS_MASK)
/*! @} */

/*! @name CPCFG - Charge Pump */
/*! @{ */

#define GDU_AE_CPCFG_CPCD_MASK                   (0x3FFU)
#define GDU_AE_CPCFG_CPCD_SHIFT                  (0U)
#define GDU_AE_CPCFG_CPCD_WIDTH                  (10U)
#define GDU_AE_CPCFG_CPCD(x)                     (((uint32_t)(((uint32_t)(x)) << GDU_AE_CPCFG_CPCD_SHIFT)) & GDU_AE_CPCFG_CPCD_MASK)

#define GDU_AE_CPCFG_CPT_MASK                    (0x3F0000U)
#define GDU_AE_CPCFG_CPT_SHIFT                   (16U)
#define GDU_AE_CPCFG_CPT_WIDTH                   (6U)
#define GDU_AE_CPCFG_CPT(x)                      (((uint32_t)(((uint32_t)(x)) << GDU_AE_CPCFG_CPT_SHIFT)) & GDU_AE_CPCFG_CPT_MASK)

#define GDU_AE_CPCFG_CPCDT_MASK                  (0x3000000U)
#define GDU_AE_CPCFG_CPCDT_SHIFT                 (24U)
#define GDU_AE_CPCFG_CPCDT_WIDTH                 (2U)
#define GDU_AE_CPCFG_CPCDT(x)                    (((uint32_t)(((uint32_t)(x)) << GDU_AE_CPCFG_CPCDT_SHIFT)) & GDU_AE_CPCFG_CPCDT_MASK)
/*! @} */

/*! @name DLYMR - Delay Measurement Result */
/*! @{ */

#define GDU_AE_DLYMR_DELAY_MASK                  (0x7FU)
#define GDU_AE_DLYMR_DELAY_SHIFT                 (0U)
#define GDU_AE_DLYMR_DELAY_WIDTH                 (7U)
#define GDU_AE_DLYMR_DELAY(x)                    (((uint16_t)(((uint16_t)(x)) << GDU_AE_DLYMR_DELAY_SHIFT)) & GDU_AE_DLYMR_DELAY_MASK)

#define GDU_AE_DLYMR_DATAVAL_MASK                (0x8000U)
#define GDU_AE_DLYMR_DATAVAL_SHIFT               (15U)
#define GDU_AE_DLYMR_DATAVAL_WIDTH               (1U)
#define GDU_AE_DLYMR_DATAVAL(x)                  (((uint16_t)(((uint16_t)(x)) << GDU_AE_DLYMR_DATAVAL_SHIFT)) & GDU_AE_DLYMR_DATAVAL_MASK)
/*! @} */

/*! @name DLYMCFG - Delay Measurement */
/*! @{ */

#define GDU_AE_DLYMCFG_CHSEL_MASK                (0x7U)
#define GDU_AE_DLYMCFG_CHSEL_SHIFT               (0U)
#define GDU_AE_DLYMCFG_CHSEL_WIDTH               (3U)
#define GDU_AE_DLYMCFG_CHSEL(x)                  (((uint16_t)(((uint16_t)(x)) << GDU_AE_DLYMCFG_CHSEL_SHIFT)) & GDU_AE_DLYMCFG_CHSEL_MASK)

#define GDU_AE_DLYMCFG_EDGESEL_MASK              (0x8U)
#define GDU_AE_DLYMCFG_EDGESEL_SHIFT             (3U)
#define GDU_AE_DLYMCFG_EDGESEL_WIDTH             (1U)
#define GDU_AE_DLYMCFG_EDGESEL(x)                (((uint16_t)(((uint16_t)(x)) << GDU_AE_DLYMCFG_EDGESEL_SHIFT)) & GDU_AE_DLYMCFG_EDGESEL_MASK)
/*! @} */

/*! @name SUPCFG - Startup Configuration */
/*! @{ */

#define GDU_AE_SUPCFG_SUP_MASK                   (0x1U)
#define GDU_AE_SUPCFG_SUP_SHIFT                  (0U)
#define GDU_AE_SUPCFG_SUP_WIDTH                  (1U)
#define GDU_AE_SUPCFG_SUP(x)                     (((uint8_t)(((uint8_t)(x)) << GDU_AE_SUPCFG_SUP_SHIFT)) & GDU_AE_SUPCFG_SUP_MASK)
/*! @} */

/*! @name IRT - Iref Trimming */
/*! @{ */

#define GDU_AE_IRT_IRT0P0_MASK                   (0x7U)
#define GDU_AE_IRT_IRT0P0_SHIFT                  (0U)
#define GDU_AE_IRT_IRT0P0_WIDTH                  (3U)
#define GDU_AE_IRT_IRT0P0(x)                     (((uint32_t)(((uint32_t)(x)) << GDU_AE_IRT_IRT0P0_SHIFT)) & GDU_AE_IRT_IRT0P0_MASK)

#define GDU_AE_IRT_IRT1P0_MASK                   (0x38U)
#define GDU_AE_IRT_IRT1P0_SHIFT                  (3U)
#define GDU_AE_IRT_IRT1P0_WIDTH                  (3U)
#define GDU_AE_IRT_IRT1P0(x)                     (((uint32_t)(((uint32_t)(x)) << GDU_AE_IRT_IRT1P0_SHIFT)) & GDU_AE_IRT_IRT1P0_MASK)

#define GDU_AE_IRT_IRT0P1_MASK                   (0x700U)
#define GDU_AE_IRT_IRT0P1_SHIFT                  (8U)
#define GDU_AE_IRT_IRT0P1_WIDTH                  (3U)
#define GDU_AE_IRT_IRT0P1(x)                     (((uint32_t)(((uint32_t)(x)) << GDU_AE_IRT_IRT0P1_SHIFT)) & GDU_AE_IRT_IRT0P1_MASK)

#define GDU_AE_IRT_IRT1P1_MASK                   (0x3800U)
#define GDU_AE_IRT_IRT1P1_SHIFT                  (11U)
#define GDU_AE_IRT_IRT1P1_WIDTH                  (3U)
#define GDU_AE_IRT_IRT1P1(x)                     (((uint32_t)(((uint32_t)(x)) << GDU_AE_IRT_IRT1P1_SHIFT)) & GDU_AE_IRT_IRT1P1_MASK)

#define GDU_AE_IRT_IRT0P2_MASK                   (0x70000U)
#define GDU_AE_IRT_IRT0P2_SHIFT                  (16U)
#define GDU_AE_IRT_IRT0P2_WIDTH                  (3U)
#define GDU_AE_IRT_IRT0P2(x)                     (((uint32_t)(((uint32_t)(x)) << GDU_AE_IRT_IRT0P2_SHIFT)) & GDU_AE_IRT_IRT0P2_MASK)

#define GDU_AE_IRT_IRT1P2_MASK                   (0x380000U)
#define GDU_AE_IRT_IRT1P2_SHIFT                  (19U)
#define GDU_AE_IRT_IRT1P2_WIDTH                  (3U)
#define GDU_AE_IRT_IRT1P2(x)                     (((uint32_t)(((uint32_t)(x)) << GDU_AE_IRT_IRT1P2_SHIFT)) & GDU_AE_IRT_IRT1P2_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group GDU_AE_Register_Masks */

/*!
 * @}
 */ /* end of group GDU_AE_Peripheral_Access_Layer */

#endif  /* #if !defined(S32M27x_GDU_AE_H_) */
